<?php
/**
 * 状态码提示数组
 * Created by PhpStorm.
 * User: bin
 * Date: 2019/3/26
 * Time: 20:12
 */
return [
    //普通
    '200'=>'请求成功！',
    '400'=>'请求失败！请稍后重试',
    '401'=>'服务繁忙,请稍后重试！',

    //登录
    '1000'=>'登录成功！',
    '1001'=>'账号不存在!',
    '1002'=>'密码错误',
    '1003'=>'账号已注册',
    '1004'=>'已登录',
    '1005'=>'请先登录',

    //上传
    '2001'=>'上传失败',
    '2002'=>'上传信息错误',
    '2000'=>'上传成功',

    //接口
    '3001'=>'没有更多数据了',
    '3002'=>'参数错误！',
    '3003'=>'删除失败！',
    '3004'=>'删除成功！',
    '3005'=>'新增失败',
    '3006'=>'新增成功',
    '3007'=>'修改失败',
    '3008'=>'修改成功',
    '3009'=>'删除成功',
    '3010'=>'删除失败',

    //数据验证
    '4001'=>'数据验证失败！',

    //活动
    '5001'=>'你还不在组织内！',
    '5002'=>'发布失败,稍后重试！',
    '5003'=>'收藏失败,请稍后重试！',
    '5004'=>'已收藏，不要重复收藏',
    '5005'=>'你没有收藏，无需取消',
    '5006'=>'取消收藏失败,请稍后重试！',
    '5007'=>'找不到该活动',
    '5008'=>'请选择要报名/取消的活动',
    '5009'=>'报名/取消失败，请稍后重试',
    '5010'=>'你已报名过该活动了,无法报名',
    '5011'=>'该活动你未报名，无需取消',
    '5012'=>'该活动还未通过审核',
    '5013'=>'该活动已删除',
    '5014'=>'超出签到范围,无法签到',
    '5015'=>'已签到,请不要重复签到',
    '5016'=>'活动已结束',
    '5017'=>'已签退，请不要重复签退',
    '5018'=>'达到每日签到上限',
    '5019'=>'你没有签到',

    //组织
    '6001'=>'组织参数错误',
    '6002'=>'找不到这个组织的信息',
    '6003'=>'请选择你要加入的组织',
    '6004'=>'你已经加入了组织，不能加入其它组织了',
    '6005'=>'未找到该组织，请核对后重新选择',
    '6006'=>'该组织还未通过审核，无法加入',
    '6007'=>'加入组织失败',

    //公益秀-评论
    '7001'=>'该评论不存在或已删除',
    '7002'=>'点赞失败,请稍后重试',
    '7003'=>'你没有点赞过该评论',
    '7004'=>'你已经点赞过该评论',
    '7005'=>'只能删除自己的评论',

    //资讯
    '8001'=>'找不到该资讯信息',

    //会议
    '11001'=>'新增失败',

    //工具类
    '9001'=>'收藏失败,请稍后重试！',
    '9002'=>'已收藏，不要重复收藏',
    '9003'=>'你没有收藏，无需取消',
    '9004'=>'取消收藏失败,请稍后重试！',
    '9005'=>'关注失败,请稍后重试！',
    '9006'=>'已关注,不要重复关注！',
    '9007'=>'你没有关注,无需取消！',
    '9008'=>'取消关注失败,请稍后重试！',

    //报警
    '10000'=>'程序发生异常，请稍后重试！',
    '10001'=>'你发布活动太频繁了，等一会再发布吧！',

];